micropython/micropython/ports/esp32/machine_pwm.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2016-2021 Damien P. George
 * Copyright (c) 2018 Alan Dragomirecky
 * Copyright (c) 2020 Antoine Aubert
 * Copyright (c) 2021, 2023, 2024 Ihor Nehrutsa
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

// This file is never compiled standalone, it's included directly from
// extmod/machine_pwm.c via MICROPY_PY_MACHINE_PWM_INCLUDEFILE.

#include <math.h>
#include "py/mphal.h"
#include "hal/ledc_hal.h"
#include "driver/ledc.h"
#include "esp_err.h"
#include "soc/gpio_sig_map.h"

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 0)
#include "esp_clk_tree.h"
#endif

#include "py/mpprint.h"

#define debug_printf(...) // mp_printf(&mp_plat_print, __VA_ARGS__); mp_printf(&mp_plat_print, ", LINE=%d\n", __LINE__);

// 5khz is default frequency
#define PWM_FREQ (5000)
// default duty 50%
#define PWM_DUTY ((1UL << UI_RES_16_BIT) / 2)

// 10-bit user interface resolution compatible with esp8266 PWM.duty()
#define UI_RES_10_BIT (10)
// Maximum duty value on 10-bit resolution
#define UI10_DUTY ((1UL << UI_RES_10_BIT) - 1)

// 16-bit user interface resolution used in PWM.duty_u16()
#define UI_RES_16_BIT (16)
// Maximum duty value on 16-bit resolution
#define UI16_DUTY ((1UL << UI_RES_16_BIT) - 1)

// timer_duty is the MAX value of a channel_duty
#define timer_duty ((1UL << timers[self->mode][self->timer].duty_resolution) - 1)

// All chips except esp32 and esp32s2 do not have timer-specific clock sources, which means clock source for all timers must be the same one.
#if CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2
// If the PWM frequency is less than EMPIRIC_FREQ, then LEDC_REF_CLK_HZ(1 MHz) source is used, else LEDC_APB_CLK_HZ(80 MHz) source is used
//#define EMPIRIC_FREQ (10) // Hz
#endif

// Config of timer upon which we run all PWM'ed GPIO pins
static bool pwm_inited = false;

// MicroPython PWM object struct
typedef struct _machine_pwm_obj_t {
    mp_obj_base_t base;
    int8_t pin;
    int8_t mode;
    int8_t channel;
    int8_t timer;
    int32_t freq;
    int8_t duty_x;    // UI_RES_10_BIT if duty(), UI_RES_16_BIT if duty_u16(), -UI_RES_16_BIT if duty_ns()
    int duty_ui;      // saved values of UI duty
    int channel_duty; // saved values of UI duty, calculated to raw channel->duty
    uint8_t output_invert;
} machine_pwm_obj_t;

typedef struct _chans_t {
    // Which channel has which GPIO pin assigned? (-1 if not assigned)
    int8_t pin;
    // Which channel has which timer assigned? (-1 if not assigned)
    int8_t timer;
} chans_t;

// List of PWM channels
static chans_t chans[LEDC_SPEED_MODE_MAX][LEDC_CHANNEL_MAX];

typedef struct _timers_t {
    int32_t freq;
    int8_t duty_resolution;
} timers_t;

// List of PWM timers
static timers_t timers[LEDC_SPEED_MODE_MAX][LEDC_TIMER_MAX];

// register-unregister channel
static void set_channel(int mode, int channel, int pin, int timer) {
    if ((mode >= 0) && (mode < LEDC_SPEED_MODE_MAX) && (channel >= 0) && (channel < LEDC_CHANNEL_MAX)) {
        chans[mode][channel].pin = pin;
        chans[mode][channel].timer = timer;
    }
}

static void pwm_init(void) {
    for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
        // Initial condition: no channels assigned
        for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
            set_channel(mode, channel, -1, -1);  // unregister
        }
        // Initial condition: no timers assigned
        for (int timer = 0; timer < LEDC_TIMER_MAX; ++timer) {
            timers[mode][timer].freq = -1; // unset timer is -1
            timers[mode][timer].duty_resolution = 0;
        }
    }
}

// Returns true if the timer is in use in addition to current channel
static bool is_timer_in_use(int mode, int current_channel, int timer) {
    for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
        if ((channel != current_channel) && (chans[mode][channel].timer == timer)) {
            return true;
        }
    }
    return false;
}

// Deinit channel and timer if the timer is unused
static void pwm_deinit(int mode, int channel, int level) {
    // Is valid channel?
    if ((mode >= 0) && (mode < LEDC_SPEED_MODE_MAX) && (channel >= 0) && (channel < LEDC_CHANNEL_MAX)) {
        // Clean up timer if necessary
        int timer = chans[mode][channel].timer;
        if (timer >= 0) {
            if (!is_timer_in_use(mode, channel, timer)) {
                check_esp_err(ledc_timer_rst(mode, timer));
                // Flag it unused
                timers[mode][timer].freq = -1;
                timers[mode][timer].duty_resolution = 0;
            }
        }

        int pin = chans[mode][channel].pin;
        if (pin >= 0) {
            // Disable LEDC output, and set idle level
            check_esp_err(ledc_stop(mode, channel, level));
        }
        set_channel(mode, channel, -1, -1); // unregister
    }
}

// This called from Ctrl-D soft reboot
void machine_pwm_deinit_all(void) {
    if (pwm_inited) {
        for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
            for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
                pwm_deinit(mode, channel, 0);
            }
        }
        pwm_inited = false;
    }
}

