micropython/micropython/ports/esp32/machine_pwm.c
static void pwm_is_active(machine_pwm_obj_t *self) {
    if (self->timer < 0) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("PWM is inactive"));
    }
}

// Calculate the duty parameters based on an ns value
static int ns_to_duty(machine_pwm_obj_t *self, int ns) {
    pwm_is_active(self);
    int64_t duty = ((int64_t)ns * UI16_DUTY * self->freq + 500000000LL) / 1000000000LL;
    if ((ns > 0) && (duty == 0)) {
        duty = 1;
    } else if (duty > UI16_DUTY) {
        duty = UI16_DUTY;
    }
    return duty;
}

static int duty_to_ns(machine_pwm_obj_t *self, int duty) {
    pwm_is_active(self);
    return ((int64_t)duty * 1000000000LL + (int64_t)self->freq * UI16_DUTY / 2) / ((int64_t)self->freq * UI16_DUTY);
}

// Reconfigure PWM pin output as input/output. This allows to read the pin level.
static void reconfigure_pin(machine_pwm_obj_t *self) {
    int invert = self->output_invert;
    if (self->channel_duty && (self->channel_duty == timer_duty)) {
        invert = invert ^ 1;
    }
    gpio_set_direction(self->pin, GPIO_MODE_INPUT_OUTPUT);
    if (self->mode == LEDC_LOW_SPEED_MODE) {
        esp_rom_gpio_connect_out_signal(self->pin, LEDC_LS_SIG_OUT0_IDX + self->channel, invert, false);
    #if SOC_LEDC_SUPPORT_HS_MODE
    } else if (self->mode == LEDC_HIGH_SPEED_MODE) {
        esp_rom_gpio_connect_out_signal(self->pin, LEDC_HS_SIG_OUT0_IDX + self->channel, invert, false);
    #endif
    }
}

static void apply_duty(machine_pwm_obj_t *self) {
    pwm_is_active(self);

    int duty = 0;
    if (self->duty_x == UI_RES_16_BIT) {
        duty = self->duty_ui;
    } else if (self->duty_x == UI_RES_10_BIT) {
        duty = self->duty_ui << (UI_RES_16_BIT - UI_RES_10_BIT);
    } else if (self->duty_x == -UI_RES_16_BIT) {
        duty = ns_to_duty(self, self->duty_ui);
    }

    int duty_resolution = timers[self->mode][self->timer].duty_resolution;
    int channel_duty;
    if (duty_resolution <= UI_RES_16_BIT) {
        channel_duty = duty >> (UI_RES_16_BIT - duty_resolution);
    } else {
        channel_duty = duty << (duty_resolution - UI_RES_16_BIT);
    }

    self->channel_duty = channel_duty;

    ledc_channel_config_t cfg = {
        .channel = self->channel,
        .duty = self->channel_duty,
        .gpio_num = self->pin,
        .intr_type = LEDC_INTR_DISABLE,
        .speed_mode = self->mode,
        .timer_sel = self->timer,
        .flags.output_invert = self->output_invert,
    };
    if (self->channel_duty && (self->channel_duty == timer_duty)) {
        cfg.duty = 0;
        cfg.flags.output_invert = self->output_invert ^ 1;
    }
    debug_printf("ledc_channel_config() self->pin=%d, self->channel=%d, self->mode=%d, self->timer=%d, cfg.duty=%d, cfg.flags.output_invert=%d",
        self->pin, self->channel, self->mode, self->timer, cfg.duty, cfg.flags.output_invert);
    check_esp_err(ledc_channel_config(&cfg));
    debug_printf("bind self->mode=%d, self->channel=%d, self->timer=%d", self->mode, self->channel, self->timer);
    check_esp_err(ledc_bind_channel_timer(self->mode, self->channel, self->timer));
    reconfigure_pin(self);
    set_channel(self->mode, self->channel, self->pin, self->timer); // register
}

// Temporary workaround for ledc_find_suitable_duty_resolution function only being added in IDF V5.2
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 2, 0)
static uint32_t calc_divider(uint32_t src_clk_freq, uint32_t timer_freq) {
    uint32_t divider = (uint32_t)(((uint64_t)src_clk_freq + timer_freq / 2) / timer_freq); // rounded
    return divider == 0 ? 1 : divider;
}

// Find the highest bit resolution for the requested frequency
static uint32_t ledc_find_suitable_duty_resolution(uint32_t src_clk_freq, uint32_t timer_freq) {
    uint32_t divider = calc_divider(src_clk_freq, timer_freq);
    uint32_t f = src_clk_freq / divider; // actual frequency
    uint32_t freq = src_clk_freq + (f / 2) / f; // rounded frequency
    uint32_t resolution = 0;
    for (; freq > 1; freq >>= 1) {
        ++resolution;
    }
    return resolution;
}
#endif

static uint32_t find_suitable_duty_resolution(uint32_t src_clk_freq, uint32_t timer_freq) {
    unsigned int resolution = ledc_find_suitable_duty_resolution(src_clk_freq, timer_freq);
    if (resolution == 0) {
        resolution = 1;
    } else if (resolution > UI_RES_16_BIT) {
        // limit resolution to user interface
        resolution = UI_RES_16_BIT;
    }
    return resolution;
}

#define ledc_duty() ledc_get_duty(self->mode, self->channel)

static uint32_t get_duty_u16(machine_pwm_obj_t *self) {
    pwm_is_active(self);
    if (self->channel_duty == timer_duty) {
        return UI16_DUTY;
    } else {
        int duty_resolution = timers[self->mode][self->timer].duty_resolution;
        if (duty_resolution <= UI_RES_16_BIT) {
            return ledc_duty() << (UI_RES_16_BIT - duty_resolution);
        } else {
            return ledc_duty() >> (duty_resolution - UI_RES_16_BIT);
        }
    }
}

static uint32_t get_duty_u10(machine_pwm_obj_t *self) {
    // Scale down from 16 bit to 10 bit resolution
    return get_duty_u16(self) >> (UI_RES_16_BIT - UI_RES_10_BIT);
}

static uint32_t get_duty_ns(machine_pwm_obj_t *self) {
    return duty_to_ns(self, get_duty_u16(self));
}

static void set_duty_u16(machine_pwm_obj_t *self, int duty) {
    if ((duty < 0) || (duty > UI16_DUTY)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty_u16 must be from 0 to %d"), UI16_DUTY);
    }

    self->duty_x = UI_RES_16_BIT;
    self->duty_ui = duty;
    apply_duty(self);
}

static void set_duty_u10(machine_pwm_obj_t *self, int duty) {
    if ((duty < 0) || (duty > UI10_DUTY)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty must be from 0 to %u"), UI10_DUTY);
    }
    self->duty_x = UI_RES_10_BIT;
    self->duty_ui = duty;
    apply_duty(self);
}

static void set_duty_ns(machine_pwm_obj_t *self, int ns) {
    if ((ns < 0) || (ns > duty_to_ns(self, UI16_DUTY))) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty_ns must be from 0 to %d ns"), duty_to_ns(self, UI16_DUTY));
    }
    self->duty_x = -UI_RES_16_BIT;
    self->duty_ui = ns;
    apply_duty(self);
}

static void set_duty(machine_pwm_obj_t *self) {
    if (self->duty_x == UI_RES_16_BIT) {
        set_duty_u16(self, self->duty_ui);
    } else if (self->duty_x == UI_RES_10_BIT) {
        set_duty_u10(self, self->duty_ui);
    } else if (self->duty_x == -UI_RES_16_BIT) {
        set_duty_ns(self, self->duty_ui);
    }
}

static void check_freq_ranges(int freq, int upper_freq) {
    if ((freq <= 0) || (freq > upper_freq)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("frequency must be from 1Hz to %dMHz"), upper_freq / 1000000);
    }
}

// Set timer frequency
static void set_freq(machine_pwm_obj_t *self, unsigned int freq) {
    self->freq = freq;
    if (timers[self->mode][self->timer].freq != freq) {
        timers[self->mode][self->timer].freq = freq;

        ledc_timer_config_t timer = {};
        timer.speed_mode = self->mode;
        timer.timer_num = self->timer;
        timer.freq_hz = freq;
        timer.deconfigure = false;

        timer.clk_cfg = LEDC_AUTO_CLK;
        uint32_t src_clk_freq = 0;

        #if SOC_LEDC_SUPPORT_APB_CLOCK
        timer.clk_cfg = LEDC_USE_APB_CLK;
        src_clk_freq = APB_CLK_FREQ; // 80 MHz
        #elif SOC_LEDC_SUPPORT_PLL_DIV_CLOCK
        timer.clk_cfg = LEDC_USE_PLL_DIV_CLK;
        #elif SOC_LEDC_SUPPORT_XTAL_CLOCK
        timer.clk_cfg = LEDC_USE_XTAL_CLK;
        src_clk_freq = XTAL_CLK_FREQ; // 40 MHz
        #else
        #error No supported PWM / LEDC clocks.
        #endif

        #ifdef EMPIRIC_FREQ // ESP32 and ESP32S2 only
        if (freq < EMPIRIC_FREQ) {
            timer.clk_cfg = LEDC_USE_REF_TICK;
            src_clk_freq = REF_CLK_FREQ; // 1 MHz
        }
        #endif

        #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 0)
        esp_err_t err = esp_clk_tree_src_get_freq_hz(timer.clk_cfg, ESP_CLK_TREE_SRC_FREQ_PRECISION_EXACT, &src_clk_freq);
        if (err != ESP_OK) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("unable to query source clock frequency %d"), (int)timer.clk_cfg);
        }
        // machine.freq(20_000_000) reduces APB_CLK_FREQ to 20MHz and the highest PWM frequency to 10MHz
        check_freq_ranges(freq, src_clk_freq / 2);
        #endif

        // Configure the new resolution
        timer.duty_resolution = find_suitable_duty_resolution(src_clk_freq, self->freq);
        timers[self->mode][self->timer].duty_resolution = timer.duty_resolution;

