micropython/micropython/ports/esp32/machine_pwm.c
        debug_printf("ledc_timer_config() timer.freq_hz=%d, timer.clk_cfg=%d, timer.duty_resolution=%d, timer.speed_mode=%d, timer.timer_num=%d",
            timer.freq_hz, timer.clk_cfg, timer.duty_resolution, timer.speed_mode, timer.timer_num);

        // Configure timer - Set frequency
        check_esp_err(ledc_timer_config(&timer));
        // Reset the timer if low speed
        if (self->mode == LEDC_LOW_SPEED_MODE) {
            check_esp_err(ledc_timer_rst(self->mode, self->timer));
        }
    }
}

static bool is_free_channels(int mode, int pin) {
    for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
        if ((chans[mode][channel].pin < 0) || (chans[mode][channel].pin == pin)) {
            return true;
        }
    }
    return false;
}

// Find self channel or free channel
static void find_channel(int pin, int *ret_mode, int *ret_channel) {
    // Try to find self channel first
    for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
        for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
            if (chans[mode][channel].pin == pin) {
                *ret_mode = mode;
                *ret_channel = channel;
                return;
            }
        }
    }
    // Find free channel
    for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
        for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
            if (chans[mode][channel].pin < 0) {
                *ret_mode = mode;
                *ret_channel = channel;
                return;
            }
        }
    }
}

// Returns timer with the same frequency, freq == -1 means free timer
static void find_tmr(int pin, int freq, int *ret_mode, int *ret_timer) {
    for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
        if (is_free_channels(mode, pin)) {
            for (int timer = 0; timer < LEDC_TIMER_MAX; ++timer) {
                if (timers[mode][timer].freq == freq) {
                    *ret_mode = mode;
                    *ret_timer = timer;
                    return;
                }
            }
        }
    }
}

// Try to find a timer with the same frequency in the current mode, otherwise in the next mode.
// If no existing timer and channel was found, then try to find free timer in any mode.
// If the mode or channel is changed, release the channel and select(bind) a new channel in the next mode.
static void select_timer(machine_pwm_obj_t *self, int freq) {
    // mode, channel, timer may be -1(not defined) or actual values
    int mode = -1;
    int timer = -1;
    // Check if an already running timer with the required frequency is running
    find_tmr(self->pin, freq, &mode, &timer);
    debug_printf("1. freq=%d, mode=%d, timer=%d", freq, mode, timer)
    if (timer < 0) {
        // Try to reuse self timer
        if ((self->mode >= 0) && (self->channel >= 0)) {
            if (!is_timer_in_use(self->mode, self->channel, self->timer)) {
                mode = self->mode;
                timer = self->timer;
                debug_printf("2. freq=%d, mode=%d, timer=%d", freq, mode, timer)
            }
        }
        // If no existing timer and channel was found, then try to find free timer in any mode
        if (timer < 0) {
            find_tmr(self->pin, -1, &mode, &timer);
            debug_printf("3. freq=%d, mode=%d, timer=%d", freq, mode, timer)
        }
    }
    if (timer < 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("out of PWM timers:%d"), LEDC_SPEED_MODE_MAX * LEDC_TIMER_MAX);
    }
    // If the timer is found, then bind
    if (self->timer != timer) {
        set_channel(self->mode, self->channel, -1, -1); // unregister
        // Bind the channel to the timer
        self->mode = mode;
        self->timer = timer;
        set_channel(self->mode, self->channel, self->pin, self->timer); // register
    }
}

/******************************************************************************/
// MicroPython bindings for PWM

static void mp_machine_pwm_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_pwm_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print, "PWM(Pin(%u)", self->pin);
    if (self->timer >= 0) {
        mp_printf(print, ", freq=%u", ledc_get_freq(self->mode, self->timer));

        if (self->duty_x == UI_RES_10_BIT) {
            mp_printf(print, ", duty=%d", get_duty_u10(self));
        } else if (self->duty_x == -UI_RES_16_BIT) {
            mp_printf(print, ", duty_ns=%d", get_duty_ns(self));
        } else {
            mp_printf(print, ", duty_u16=%d", get_duty_u16(self));
        }
        if (self->output_invert) {
            mp_printf(print, ", invert=%d", self->output_invert);
        }
        mp_printf(print, ")");
        #if 1//MICROPY_ERROR_REPORTING > MICROPY_ERROR_REPORTING_NORMAL
        mp_printf(print, "  #");
        mp_printf(print, " duty=%.2f%%", 100.0 * get_duty_u16(self) / UI16_DUTY); // percents
        int duty_resolution = timers[self->mode][self->timer].duty_resolution;
        mp_printf(print, ", raw_duty=%d, resolution=%d", ledc_duty(), duty_resolution);
        mp_printf(print, ", mode=%d, channel=%d, timer=%d", self->mode, self->channel, self->timer);
        #endif
    } else {
        mp_printf(print, ")");
    }
}

// This called from pwm.init() method
/*
Check the current mode.
If the frequency is changed, try to find a timer with the same frequency
in the current mode, otherwise in the new mode.
If the mode is changed, release the channel and select a new channel in the new mode.
Then set the frequency with the same duty.
*/
static void mp_machine_pwm_init_helper(machine_pwm_obj_t *self,
    size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {

    enum { ARG_freq, ARG_duty, ARG_duty_u16, ARG_duty_ns, ARG_invert };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_freq, MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_duty, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_duty_u16, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_duty_ns, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_invert, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1}},
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args,
        MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    int freq = args[ARG_freq].u_int;
    if (freq != -1) {
        check_freq_ranges(freq, 40000000);
    }

    int duty = args[ARG_duty].u_int;
    int duty_u16 = args[ARG_duty_u16].u_int;
    int duty_ns = args[ARG_duty_ns].u_int;
    if (duty_u16 >= 0) {
        self->duty_x = UI_RES_16_BIT;
        self->duty_ui = duty_u16;
    } else if (duty_ns >= 0) {
        self->duty_x = -UI_RES_16_BIT;
        self->duty_ui = duty_ns;
    } else if (duty >= 0) {
        self->duty_x = UI_RES_10_BIT;
        self->duty_ui = duty;
    } else if (self->duty_x == 0) {
        self->duty_x = UI_RES_16_BIT;
        self->duty_ui = PWM_DUTY;
    }

